<b>Get File Events based on a Hostnmae</b>
// Define the host you want to investigate
DeviceFileEvents
| where DeviceName == "${WORKSTATION HOSTNAME}"
 
DeviceInfo

--------------------------------------------------------
